Repository: giellalt/corpus-fin
Catalog: tmx/sme/facta/giellatekno/sahka.fin.html.tmx
Source language: fin
Languages: sme

source: Keskustelut ovat:
sme: Ságastallamat leat:

source: Sahka on interaktiivinen keskusteluohjelma.
sme: Sahka lea interaktiivvalaš ságastallan.

source: Oppilas pääsee keskustelemaan tietokoneen kanssa.
sme: Oahppi beassá ságastallat dihtoriin.

source: Tavoitteena on harjoitella verbitaivutusta ja sijamuotojen käyttöä, ja laajentaa sanastoa. Sen takia pitää vastata kokonaisella lauseella, ja yleensä myös vastata samalla verbillä kun kysymyksessä on esitetty, esim.
sme: Ulbmil lea hárjehallat vearbasojaheami, kasusgeavaheami ja nannet sátnevuorkká, ja dan dihte ferte vástidit olles cealkagiin, ja dábálaččat geavahit seammá vearbba go jearaldagas, omd.

source: Usein tietokone antaa myös avoin kysymys.
sme: - Jugat go gáfe ? - Gal mun jugan. / In juga.

source: Siinä voi myös olla sanalista (esim.
sme: Dávjá leat rabas jearaldagat.

source: ruokalista tai piirrostus).
sme: Vejolaččat lea sátnelistu (omd. borramušmenya dahje tevnnet).

source: Muihin vastauksiin on mahdollista vastata mitä vain, jos vain vastaus on muuten oikein.
sme: Eará jearaldagaide sáhttá vástidit maid beare, muhto ferte geavahit rivttes kasusa.

source: Ohjelma huomauttaa tavallisimmista virhetyyppeistä, mutta monta virhettä jää huomaamatta.
sme: Prográmma fuomášuhttá vuosttažettiin muhtun dábálaš giellameattáhusaid, muhto ii juohke meattáhusa.

source: Oahpásmuvvan Kárii (tavalliset kysymykset henkilökohtaisista asioista).
sme: Oahpásmuvvan Kárii (dábálaš jearaldagat persovnnalaš áššiin).

source: Guossis (missä oppilas pääse käyttämään kaksikkoa (" moai ") ja myös harjoittelemaan lokatiivia ja illatiivia, lopussa myös akkusatiivia.)
sme: Guossis (Dás beassá geavahit duála (" moai ") ja maid hárjehallat lokatiivva ja illatiivva. Loahpas lea maid akkusatiiva.)

source: Borramušgávppis (Harjoitella akkusatiivia.)
sme: Borramušgávppis (Hárjehallat akkusatiivva.)

source: Linkki Sahka-ohjelmaan
sme: Liŋka Sahka-prográmmii
